In [1]:
import pandas as pd
import numpy as np

In [2]:
from nba_api.stats.static import teams

In [3]:
new_teams = pd.DataFrame(teams.get_teams())

In [5]:
new_teams.head()

,id,full_name,abbreviation,nickname,city,state,year_founded
0,1610612737,Atlanta Hawks,ATL,Hawks,Atlanta,Georgia,1949
1,1610612738,Boston Celtics,BOS,Celtics,Boston,Massachusetts,1946
2,1610612739,Cleveland Cavaliers,CLE,Cavaliers,Cleveland,Ohio,1970
3,1610612740,New Orleans Pelicans,NOP,Pelicans,New Orleans,Louisiana,2002
4,1610612741,Chicago Bulls,CHI,Bulls,Chicago,Illinois,1966

In [6]:
new_teams.to_csv('teams.csv',index=False)